# StairstypeHasRightSupport Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeHasRightSupport Property
ParameterTypeId Class See Also
---
"Right Support":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeHasRightSupport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeHasRightSupport As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeHasRightSupport {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace